<h1>Exercise 44</h1>
<p>Write a query to list emp name along with their manager and senior manager name. The senior manager is the manager of the manager.</p>
<strong>Expected outcome:</strong>
<br>
<img src="Day-44-Expected_Output.png" width="450">

In [1]:
import os
import sqlite3
import pandas as pd

db_name="exercise44.db"
conn=sqlite3.connect(db_name)
cursor=conn.cursor()

cursor.execute("""CREATE TABLE IF NOT EXISTS emp(emp_id INT, emp_name VARCHAR(20), department_id INT, salary INT, manager_id INT, emp_age INT)""")
conn.commit()

emp_data=[
    (1, 'Ankit', 100,10000, 4, 39),
    (2, 'Mohit', 100, 15000, 5, 48),
    (3, 'Vikas', 100, 12000,4,37),
    (4, 'Rohit', 100, 14000, 2, 16),
    (5, 'Mudit', 200, 20000, 6,55),
    (6, 'Agam', 200, 12000,2, 14),
    (7, 'Sanjay', 200, 9000, 2,13),
    (8, 'Ashish', 200,5000,2,12),
    (9, 'Mukesh',300,6000,6,51),
    (10, 'Rakesh',500,7000,6,50)
]
cursor.executemany("INSERT INTO emp VALUES(?,?,?,?,?,?)",emp_data)
conn.commit()

querytoexec="SELECT * FROM emp"
df=pd.read_sql(querytoexec,conn)
print(df)

   emp_id emp_name  department_id  salary  manager_id  emp_age
0       1    Ankit            100   10000           4       39
1       2    Mohit            100   15000           5       48
2       3    Vikas            100   12000           4       37
3       4    Rohit            100   14000           2       16
4       5    Mudit            200   20000           6       55
5       6     Agam            200   12000           2       14
6       7   Sanjay            200    9000           2       13
7       8   Ashish            200    5000           2       12
8       9   Mukesh            300    6000           6       51
9      10   Rakesh            500    7000           6       50

In [2]:
querytoexec="SELECT e.emp_id, e.emp_name, m.emp_name AS manager_name, sm.emp_name AS senior_manager, m.salary AS manager_salary FROM emp AS e LEFT JOIN emp AS m ON e.manager_id=m.emp_id LEFT JOIN emp AS sm ON m.manager_id=sm.emp_id WHERE e.salary>sm.salary"
df=pd.read_sql(querytoexec,conn)
print(df)
conn.close()

   emp_id emp_name manager_name senior_manager  manager_salary
0       2    Mohit        Mudit           Agam           20000
1       5    Mudit         Agam          Mohit           12000